_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 64, 480, 1)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 64, 480, 8)        1024      
_________________________________________________________________
batch_normalization_1 (Batch (None, 64, 480, 8)        256       
_________________________________________________________________
depthwise_conv2d_1 (Depthwis (None, 1, 480, 16)        1024      
_________________________________________________________________
batch_normalization_2 (Batch (None, 1, 480, 16)        4         
_________________________________________________________________
activation_1 (Activation)    (None, 1, 480, 16)        0         
_________________________________________________________________
average_pooling2d_1 (Average (None, 1, 60, 16)         0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 1, 60, 16)         0         
_________________________________________________________________
separable_conv2d_1 (Separabl (None, 1, 60, 16)         512       
_________________________________________________________________
batch_normalization_3 (Batch (None, 1, 60, 16)         4         
_________________________________________________________________
activation_2 (Activation)    (None, 1, 60, 16)         0         
_________________________________________________________________
average_pooling2d_2 (Average (None, 1, 7, 16)          0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 1, 7, 16)          0         
_________________________________________________________________
flatten (Flatten)            (None, 112)               0         
_________________________________________________________________
dense (Dense)                (None, 4)                 452       
_________________________________________________________________
softmax (Activation)         (None, 4)                 0         
=================================================================
Total params: 3,276
Trainable params: 3,144
Non-trainable params: 132
_________________________________________________________________
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 38, 107, 1)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 38, 107, 8)        344       
_________________________________________________________________
batch_normalization_1 (Batch (None, 38, 107, 8)        32        
_________________________________________________________________
depthwise_conv2d_1 (Depthwis (None, 1, 107, 16)        608       
_________________________________________________________________
batch_normalization_2 (Batch (None, 1, 107, 16)        64        
_________________________________________________________________
activation_1 (Activation)    (None, 1, 107, 16)        0         
_________________________________________________________________
average_pooling2d_1 (Average (None, 1, 35, 16)         0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 1, 35, 16)         0         
_________________________________________________________________
separable_conv2d_1 (Separabl (None, 1, 35, 16)         512       
_________________________________________________________________
batch_normalization_3 (Batch (None, 1, 35, 16)         64        
_________________________________________________________________
activation_2 (Activation)    (None, 1, 35, 16)         0         
_________________________________________________________________
average_pooling2d_2 (Average (None, 1, 4, 16)          0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 1, 4, 16)          0         
_________________________________________________________________
flatten (Flatten)            (None, 64)                0         
_________________________________________________________________
dense (Dense)                (None, 4)                 260       
_________________________________________________________________
softmax (Activation)         (None, 4)                 0         
=================================================================
Total params: 1,884
Trainable params: 1,804
Non-trainable params: 80
_________________________________________________________________
