EEGNet
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 64, 480, 1)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 64, 480, 8)        1024      
_________________________________________________________________
batch_normalization_1 (Batch (None, 64, 480, 8)        256       
_________________________________________________________________
depthwise_conv2d_1 (Depthwis (None, 1, 480, 16)        1024      
_________________________________________________________________
batch_normalization_2 (Batch (None, 1, 480, 16)        4         
_________________________________________________________________
activation_1 (Activation)    (None, 1, 480, 16)        0         
_________________________________________________________________
average_pooling2d_1 (Average (None, 1, 60, 16)         0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 1, 60, 16)         0         
_________________________________________________________________
separable_conv2d_1 (Separabl (None, 1, 60, 16)         512       
_________________________________________________________________
batch_normalization_3 (Batch (None, 1, 60, 16)         4         
_________________________________________________________________
activation_2 (Activation)    (None, 1, 60, 16)         0         
_________________________________________________________________
average_pooling2d_2 (Average (None, 1, 7, 16)          0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 1, 7, 16)          0         
_________________________________________________________________
flatten (Flatten)            (None, 112)               0         
_________________________________________________________________
dense (Dense)                (None, 4)                 452       
_________________________________________________________________
softmax (Activation)         (None, 4)                 0         
=================================================================
Total params: 3,276
Trainable params: 3,144
Non-trainable params: 132
_________________________________________________________________
None


edgeEEGNet
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_2 (InputLayer)         (None, 64, 480, 1)        0         
_________________________________________________________________
depthwise_conv2d_2 (Depthwis (None, 1, 480, 2)         128       
_________________________________________________________________
batch_normalization_4 (Batch (None, 1, 480, 2)         4         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 1, 480, 8)         2048      
_________________________________________________________________
batch_normalization_5 (Batch (None, 1, 480, 8)         4         
_________________________________________________________________
activation_3 (Activation)    (None, 1, 480, 8)         0         
_________________________________________________________________
average_pooling2d_3 (Average (None, 1, 60, 8)          0         
_________________________________________________________________
dropout_3 (Dropout)          (None, 1, 60, 8)          0         
_________________________________________________________________
separable_conv2d_2 (Separabl (None, 1, 60, 16)         256       
_________________________________________________________________
batch_normalization_6 (Batch (None, 1, 60, 16)         4         
_________________________________________________________________
activation_4 (Activation)    (None, 1, 60, 16)         0         
_________________________________________________________________
average_pooling2d_4 (Average (None, 1, 7, 16)          0         
_________________________________________________________________
dropout_4 (Dropout)          (None, 1, 7, 16)          0         
_________________________________________________________________
flatten (Flatten)            (None, 112)               0         
_________________________________________________________________
dense (Dense)                (None, 4)                 452       
_________________________________________________________________
softmax (Activation)         (None, 4)                 0         
=================================================================
Total params: 2,896
Trainable params: 2,890
Non-trainable params: 6
_________________________________________________________________
None


edgeEEGNetC
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_3 (InputLayer)         (None, 64, 480, 1)        0         
_________________________________________________________________
depthwise_conv2d_3 (Depthwis (None, 1, 480, 8)         512       
_________________________________________________________________
batch_normalization_7 (Batch (None, 1, 480, 8)         4         
_________________________________________________________________
depthwise_conv2d_4 (Depthwis (None, 1, 480, 8)         1024      
_________________________________________________________________
batch_normalization_8 (Batch (None, 1, 480, 8)         4         
_________________________________________________________________
activation_5 (Activation)    (None, 1, 480, 8)         0         
_________________________________________________________________
average_pooling2d_5 (Average (None, 1, 60, 8)          0         
_________________________________________________________________
dropout_5 (Dropout)          (None, 1, 60, 8)          0         
_________________________________________________________________
separable_conv2d_3 (Separabl (None, 1, 60, 16)         256       
_________________________________________________________________
batch_normalization_9 (Batch (None, 1, 60, 16)         4         
_________________________________________________________________
activation_6 (Activation)    (None, 1, 60, 16)         0         
_________________________________________________________________
average_pooling2d_6 (Average (None, 1, 7, 16)          0         
_________________________________________________________________
dropout_6 (Dropout)          (None, 1, 7, 16)          0         
_________________________________________________________________
flatten (Flatten)            (None, 112)               0         
_________________________________________________________________
dense (Dense)                (None, 4)                 452       
_________________________________________________________________
softmax (Activation)         (None, 4)                 0         
=================================================================
Total params: 2,256
Trainable params: 2,250
Non-trainable params: 6
_________________________________________________________________
None


edgeEEGNetCF1
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_4 (InputLayer)         (None, 64, 480, 1)        0         
_________________________________________________________________
depthwise_conv2d_5 (Depthwis (None, 1, 480, 16)        1024      
_________________________________________________________________
batch_normalization_10 (Batc (None, 1, 480, 16)        4         
_________________________________________________________________
depthwise_conv2d_6 (Depthwis (None, 1, 480, 16)        2048      
_________________________________________________________________
batch_normalization_11 (Batc (None, 1, 480, 16)        4         
_________________________________________________________________
activation_7 (Activation)    (None, 1, 480, 16)        0         
_________________________________________________________________
average_pooling2d_7 (Average (None, 1, 60, 16)         0         
_________________________________________________________________
dropout_7 (Dropout)          (None, 1, 60, 16)         0         
_________________________________________________________________
separable_conv2d_4 (Separabl (None, 1, 60, 16)         512       
_________________________________________________________________
batch_normalization_12 (Batc (None, 1, 60, 16)         4         
_________________________________________________________________
activation_8 (Activation)    (None, 1, 60, 16)         0         
_________________________________________________________________
average_pooling2d_8 (Average (None, 1, 7, 16)          0         
_________________________________________________________________
dropout_8 (Dropout)          (None, 1, 7, 16)          0         
_________________________________________________________________
flatten (Flatten)            (None, 112)               0         
_________________________________________________________________
dense (Dense)                (None, 4)                 452       
_________________________________________________________________
softmax (Activation)         (None, 4)                 0         
=================================================================
Total params: 4,048
Trainable params: 4,042
Non-trainable params: 6
_________________________________________________________________
None



cubeEEGNet
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 64, 480, 1)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 64, 480, 8)        1024      
_________________________________________________________________
batch_normalization_1 (Batch (None, 64, 480, 8)        32        
_________________________________________________________________
depthwise_conv2d_1 (Depthwis (None, 1, 480, 16)        1024      
_________________________________________________________________
batch_normalization_2 (Batch (None, 1, 480, 16)        64        
_________________________________________________________________
activation_1 (Activation)    (None, 1, 480, 16)        0         
_________________________________________________________________
average_pooling2d_1 (Average (None, 1, 60, 16)         0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 1, 60, 16)         0         
_________________________________________________________________
separable_conv2d_1 (Separabl (None, 1, 60, 16)         512       
_________________________________________________________________
batch_normalization_3 (Batch (None, 1, 60, 16)         64        
_________________________________________________________________
activation_2 (Activation)    (None, 1, 60, 16)         0         
_________________________________________________________________
average_pooling2d_2 (Average (None, 1, 7, 16)          0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 1, 7, 16)          0         
_________________________________________________________________
flatten (Flatten)            (None, 112)               0         
_________________________________________________________________
dense (Dense)                (None, 4)                 452       
_________________________________________________________________
softmax (Activation)         (None, 4)                 0         
=================================================================
Total params: 3,172
Trainable params: 3,092
Non-trainable params: 80
_________________________________________________________________
None


cubeedgeEEGNet
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_2 (InputLayer)         (None, 64, 480, 1)        0         
_________________________________________________________________
depthwise_conv2d_2 (Depthwis (None, 1, 480, 16)        1024      
_________________________________________________________________
batch_normalization_4 (Batch (None, 1, 480, 16)        64        
_________________________________________________________________
depthwise_conv2d_3 (Depthwis (None, 1, 480, 16)        2048      
_________________________________________________________________
batch_normalization_5 (Batch (None, 1, 480, 16)        64        
_________________________________________________________________
activation_3 (Activation)    (None, 1, 480, 16)        0         
_________________________________________________________________
average_pooling2d_3 (Average (None, 1, 60, 16)         0         
_________________________________________________________________
dropout_3 (Dropout)          (None, 1, 60, 16)         0         
_________________________________________________________________
separable_conv2d_2 (Separabl (None, 1, 60, 16)         512       
_________________________________________________________________
batch_normalization_6 (Batch (None, 1, 60, 16)         64        
_________________________________________________________________
activation_4 (Activation)    (None, 1, 60, 16)         0         
_________________________________________________________________
average_pooling2d_4 (Average (None, 1, 7, 16)          0         
_________________________________________________________________
dropout_4 (Dropout)          (None, 1, 7, 16)          0         
_________________________________________________________________
flatten (Flatten)            (None, 112)               0         
_________________________________________________________________
dense (Dense)                (None, 4)                 452       
_________________________________________________________________
softmax (Activation)         (None, 4)                 0         
=================================================================
Total params: 4,228
Trainable params: 4,132
Non-trainable params: 96
_________________________________________________________________
None

